In [3]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp311-cp311-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.23.2 in c:\users\verginia\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\verginia\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\verginia\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp311-cp311-win_amd64.whl (11.3 MB)
   ---------------------------------------- 0.0/11.3 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.3 MB 991.0 kB/s eta 0:00:12
   ---------------------------------------- 0.1/11.3 MB 1.7 MB/s eta 0:00:07
   ---------------------------------------- 0.1/11.3 MB 901.1 kB/s eta 0:00:13
    --------------------------------------- 0.2/11.3 MB 1.1 MB/s eta 0:00:11
   -- ------------------------------------- 0.8/11.3 MB 3.5 MB/s eta 0:00:04
   ------ --------------------------------- 1.8/11.3 MB 6.8 MB/s eta 0:00:02
   --------- ------------------------------ 2.7/11.3 MB 8.5 MB/s eta 0:00:02
   ----------- ---------------------------- 3.2/11.3 MB 9.7 MB/s eta 0:00:01
   ---------------- ----------------------- 4.7/11.3 MB 11.9 MB/s eta 0:00:01
   ---------------------- ----------------- 6.5/11.3 MB 14.8 MB/s eta 0:00:01
   ------------------------- -------------- 7.2/11.3 MB 14.8 MB/s eta 0:00:01
   ---------------------------- ----------- 8.0/11.3 MB 14.6 MB/s eta 0:00:01
   ------------------------------- -------- 8.9/11.3 MB 14.9 MB/s eta 0:00:01
   --------------------------------- ------ 9.5/11.3 MB 15.1 MB/s eta 0:00:01
   ------------------------------------ --- 10.2/11.3 MB 15.2 MB/s eta 0:00:01
   -------------------------------------- - 11.0/11.3 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.3 MB 19.8 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.3 MB 19.8 MB/s eta 0:00:01
   ---------------------------------------- 11.3/11.3 MB 16.8 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
   ---------------------------------------- 0.0/509.2 kB ? eta -:--:--
   --------------------------------------  501.8/509.2 kB 30.7 MB/s eta 0:00:01
   --------------------------------------- 509.2/509.2 kB 10.6 MB/s eta 0:00:00
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
   ---------------------------------------- 0.0/347.8 kB ? eta -:--:--
   --------------------------------------- 347.8/347.8 kB 10.9 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.2
[notice] To update, run: C:\Users\verginia\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [5]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  7  9  6  8  2
1  4  5  5  9  7
2  5  7  9  2  9
3  9  4  3  9  5
4  5  3  4  5  5

In [6]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [7]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        7        9        6        8        2
1        4        5        5        9        7
2        5        7        9        2        9
3        9        4        3        9        5
4        5        3        4        5        5

In [8]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        7        9        6        8        2
1        4        5        5        9        7
2        5        7        9        2        9
3        9        4        3        9        5
4        5        3        4        5        5

#02: Pemilihan baris (rows selection) pada Data Frame

In [9]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [10]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  3  1  1  3
1  3  1  3  2  3
2  1  1  1  1  1
3  3  4  1  2  3
4  1  3  3  2  3
5  3  3  2  1  2
6  2  2  2  1  2
7  2  1  4  2  1
8  2  2  4  3  1
9  3  3  2  2  1

In [11]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  3  1  3  2  3
2  1  1  1  1  1
3  3  4  1  2  3
4  1  3  3  2  3
5  3  3  2  1  2
9  3  3  2  2  1

In [12]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
1  3  1  3  2  3
2  1  1  1  1  1
3  3  4  1  2  3
4  1  3  3  2  3
5  3  3  2  1  2
9  3  3  2  2  1

In [13]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  2  3  1  1  3
6  2  2  2  1  2
7  2  1  4  2  1
8  2  2  4  3  1

#03: Konversi tipe data String ke Numerik pada kolom Data Frame

In [14]:
import pandas as pd

print(pd.__version__)

2.3.3

In [15]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [16]:
df.dtypes

col1    object
col2    object
dtype: object

In [17]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [18]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [19]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

#04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

In [20]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [21]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00         17.0         16    A
1 2024-10-01 01:00:00          3.0          8    B
2 2024-10-01 02:00:00          8.0         11    C
3 2024-10-01 03:00:00          8.0         11    D
4 2024-10-01 04:00:00          5.0         13    E

In [22]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [23]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         17.0         16
1          3.0          8
2          8.0         11
3          8.0         11
4          5.0         13

In [24]:
df.select_dtypes(include='float')

   bil_pecahan
0         17.0
1          3.0
2          8.0
3          8.0
4          5.0

In [25]:
df.select_dtypes(include='int')

   bil_bulat
0         16
1          8
2         11
3         11
4         13

In [26]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [27]:
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

In [28]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         17.0         16    A
1          3.0          8    B
2          8.0         11    C
3          8.0         11    D
4          5.0         13    E